src/xml/find-folder.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
    <soap:Body>
        <FindFolder Traversal="Shallow" xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
            <FolderShape>
                <t:BaseShape>Default</t:BaseShape>
            </FolderShape>
            <ParentFolderIds>
                <t:DistinguishedFolderId Id="{0}"/>
            </ParentFolderIds>
        </FindFolder>
    </soap:Body>
</soap:Envelope>